index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-28 Tue 10:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>An Introduction to Futures Spreads</title>
<meta name="author" content="Matt Brigida, Ph.D." />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" type="text/css" href="mystyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">An Introduction to Futures Spreads</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org82d4512">1. Refining Spreads</a>
<ul>
<li><a href="#orgad9042b">1.1. Crack Spread</a></li>
<li><a href="#org253f437">1.2. Crack Spread Calculator</a></li>
</ul>
</li>
<li><a href="#org7e7b4b7">2. Crack Spread Over Time</a></li>
<li><a href="#org26b5c70">3. Crush Spread</a></li>
<li><a href="#org1a88a62">4. Calculating the Crush Spread</a></li>
<li><a href="#org067c7f4">5. Crush Spread Calculator</a></li>
<li><a href="#org40bd1f0">6. Calendar Spreads</a></li>
<li><a href="#org278f641">7. Locational Spreads</a></li>
</ul>
</div>
</div>
<p>
Many market participants need to hedge against relative changes in prices rather than absolute changes.  For example, if your firm refines oil they only care about the relative price between their input (crude oil) and output (gasoline). Similarly, when a natural gas producer decides whether to sell or store gas, they care about the differential in prices between delivery months.  
</p>


<div id="outline-container-org82d4512" class="outline-2">
<h2 id="org82d4512"><span class="section-number-2">1.</span> Refining Spreads</h2>
<div class="outline-text-2" id="text-1">
<p>
Below we'll discuss 3 refining spreads: the crack; crush; and spark spreads.
</p>
</div>

<div id="outline-container-orgad9042b" class="outline-3">
<h3 id="orgad9042b"><span class="section-number-3">1.1.</span> Crack Spread</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Crude oil is refined (cracked) into heating oil and gasoline.  We use the term <i>crack</i> because to refine the crude oil it is put into a tall column and heated, which causes the crude oil to separate (crack) into lighter gasoline and heavier heating oil.
</p>

<p>
NYMEX Crude Oil (ticker CL) contracts are for 1000 barrels.
</p>
</div>
</div>

<div id="outline-container-org253f437" class="outline-3">
<h3 id="org253f437"><span class="section-number-3">1.2.</span> Crack Spread Calculator</h3>
<div class="outline-text-3" id="text-1-2">
<style>
.fiddle iframe {
height: 300px //you can manually change this height
}
</style>

<div class="fiddle">
<script async src="https://jsfiddle.net/mbkr1/g6rkdq85/embed/result,js,html,css/dark/"></script>
</div>

<p>
The calculator is here:
</p>

<p>
<a href="https://jsfiddle.net/mbkr1/g6rkdq85/embed/result,js,html,css/dark/">https://jsfiddle.net/mbkr1/g6rkdq85/embed/result,js,html,css/dark/</a>
</p>
</div>
</div>
</div>

<div id="outline-container-org7e7b4b7" class="outline-2">
<h2 id="org7e7b4b7"><span class="section-number-2">2.</span> Crack Spread Over Time</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-R"><span style="color: #268bd2; font-weight: bold;">library</span>(EIAdata)

key <span style="color: #268bd2; font-weight: bold;">&lt;-</span> <span style="color: #268bd2; font-weight: bold;">source</span>(<span style="color: #2aa198;">"~/eia_key"</span>)$value

cl1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getEIA(<span style="color: #2aa198;">"PET.RCLC1.D"</span>, key=key)
rb1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getEIA(<span style="color: #2aa198;">"PET.EER_EPMRR_PE1_Y35NY_DPG.D"</span>, key = key)
ho1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> getEIA(<span style="color: #2aa198;">"PET.EER_EPD2F_PE1_Y35NY_DPG.D"</span>, key = key)

prices1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> merge.xts(cl1, rb1, ho1)

prices1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> prices1[complete.cases(prices1), ]

crack_bbl_1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> 42 * (2/3) * prices1$PET.EER_EPMRR_PE1_Y35NY_DPG.D + 42 * (1/3) * prices1$PET.EER_EPD2F_PE1_Y35NY_DPG.D - prices1$PET.RCLC1.D

crack_per_1 <span style="color: #268bd2; font-weight: bold;">&lt;-</span> crack_bbl_1 / prices1$PET.RCLC1.D
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">plot(crack_bbl_1[<span style="color: #2aa198;">"2019/"</span>])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R">plot(crack_per_1[<span style="color: #2aa198;">"2019/"</span>])
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #268bd2; font-weight: bold;">library</span>(highcharter)
<span style="color: #268bd2; font-weight: bold;">library</span>(htmlwidgets)
hc <span style="color: #268bd2; font-weight: bold;">&lt;-</span> hchart(crack_per_1) <span style="color: #268bd2; font-weight: bold;">%&gt;%</span> hc_add_theme(hc_theme_economist()) <span style="color: #268bd2; font-weight: bold;">%&gt;%</span> hc_title(text = <span style="color: #2aa198;">"Percent Refining Margin (% Crack Spread) Over Time"</span>, margin = 20, align = <span style="color: #2aa198;">"left"</span>)
saveWidget(hc, <span style="color: #2aa198;">"crack_per_1_widget.html"</span>)
</pre>
</div>

<iframe width="100%" height="500px" frameBorder=0 src="./crack_per_1_widget.html"></iframe>
</div>
</div>




<div id="outline-container-org26b5c70" class="outline-2">
<h2 id="org26b5c70"><span class="section-number-2">3.</span> Crush Spread</h2>
<div class="outline-text-2" id="text-3">
<p>
The Crush Spread is the refining margin on Soybeans.   
</p>

<p>
<a href="https://www.cmegroup.com/education/files/soybean-crush-reference-guide.pdf">The CME has a great reference guide.</a>
</p>
</div>
</div>

<div id="outline-container-org1a88a62" class="outline-2">
<h2 id="org1a88a62"><span class="section-number-2">4.</span> Calculating the Crush Spread</h2>
<div class="outline-text-2" id="text-4">
<p>
Calculation from here: <a href="https://papers.ssrn.com/sol3/papers.cfm?abstract_id=987507&amp;download=yes">https://papers.ssrn.com/sol3/papers.cfm?abstract_id=987507&amp;download=yes</a>
</p>

<p>
Crush Spread = (Soybean Meal in $ per ton x 100) + (Soybean Oil in $ per 100 lbs. x 600) – (Soybeans in cents per bu. x 50)
</p>
</div>
</div>

<div id="outline-container-org067c7f4" class="outline-2">
<h2 id="org067c7f4"><span class="section-number-2">5.</span> Crush Spread Calculator</h2>
<div class="outline-text-2" id="text-5">
<style>
.fiddle iframe {
height: 300px //you can manually change this height
}
</style>

<div class="fiddle">
<script async src="https://jsfiddle.net/mbkr1/hpur8feq/embed/result,js,html,css/dark/"></script>
</div>
</div>
</div>



<div id="outline-container-org40bd1f0" class="outline-2">
<h2 id="org40bd1f0"><span class="section-number-2">6.</span> Calendar Spreads</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>Calendar spreads can hedge storage costs.</li>
</ul>
</div>
</div>

<div id="outline-container-org278f641" class="outline-2">
<h2 id="org278f641"><span class="section-number-2">7.</span> Locational Spreads</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>Locational spreads hedge the cost of transportation from one point to another.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2023-11-28 Tue 10:24</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>